TablesBasics
  extensions [ table ]
  globals [glob1]
  O> set glob1 table:make
  O> table:put glob1 0 "testvalue"
  O> table:put glob1 "testkey" 1
  table:length glob1 => 2
  table:get glob1 "testkey" => 1
  table:get glob1 0 => "testvalue"
  table:keys glob1 => [0 "testkey"]
  table:has-key? glob1 0 => true
  table:has-key? glob1 3 => false
  table:has-key? glob1 "testkey" => true
  table:has-key? glob1 "somestring" => false
  O> table:clear glob1
  table:length glob1 => 0

TablesToFromList
  extensions [ table ]
  globals [glob1 glob2]
  O> set glob1 [[1 2] ["key" "value"]]
  O> set glob2 table:from-list glob1
  table:get glob2 "key" => "value"
  table:get glob2 1 => 2
  table:get glob2 4 => ERROR Extension exception: No value for 4 in table.
  glob1 = table:to-list glob2 => true

TablesAllowableTypes
  extensions [ table ]
  globals [glob1]
  O> set glob1 table:make
  O> table:put glob1 0 "number"
  O> table:put glob1 "foo" "string"
  O> table:put glob1 true "boolean"
  O> table:put glob1 false "boolean"
  O> table:put glob1 nobody "nobody" => ERROR Extension exception: nobody is not a valid table key (a table key may only be a number, a string, true or false, or a list whose items are valid keys)
  O> table:put glob1 turtles "turtle set" => ERROR Extension exception: turtles is not a valid table key (a table key may only be a number, a string, true or false, or a list whose items are valid keys)
  O> table:put glob1 patches "patch set" => ERROR Extension exception: patches is not a valid table key (a table key may only be a number, a string, true or false, or a list whose items are valid keys)
  O> table:put glob1 links "link set" => ERROR Extension exception: links is not a valid table key (a table key may only be a number, a string, true or false, or a list whose items are valid keys)
  O> table:put glob1 turtle 0 "nonexistent turtle" => ERROR Extension exception: nobody is not a valid table key (a table key may only be a number, a string, true or false, or a list whose items are valid keys)
  O> crt 1
  O> table:put glob1 turtle 0 "turtle" => ERROR Extension exception: (turtle 0) is not a valid table key (a table key may only be a number, a string, true or false, or a list whose items are valid keys)
  O> ct
  O> table:put glob1 turtle 0 "dead turtle" => ERROR Extension exception: nobody is not a valid table key (a table key may only be a number, a string, true or false, or a list whose items are valid keys)
  O> table:put glob1 [] "list"
  O> table:put glob1 [1] "1"
  O> table:put glob1 [1] "2"
  table:get glob1 [1] => "2"
  O> table:put glob1 [[1] ["two" "three"] [4]] "uh huh"
  table:get glob1 [[1] ["two" "three"] [4]] => "uh huh"

TablesAllowableTypes_2D
  extensions [ table ]
  globals [glob1]
  O> set glob1 table:make
  O> crt 1
  O> table:put glob1 [patch-here] of turtle 0 "patch" => ERROR Extension exception: (patch 0 0) is not a valid table key (a table key may only be a number, a string, true or false, or a list whose items are valid keys)

TablesAllowableTypes_3D
  extensions [ table ]
  globals [glob1]
  O> set glob1 table:make
  O> crt 1
  O> table:put glob1 patch 0 0 0 "patch" => ERROR Extension exception: (patch 0 0 0) is not a valid table key (a table key may only be a number, a string, true or false, or a list whose items are valid keys)

TablesEquality
  extensions [ table ]
  globals [glob1 glob2]
  O> set glob1 table:make
  glob1 = 0 => false
  0 = glob1 => false
  glob1 = [] => false
  [] = glob1 => false
  glob1 = "" => false
  "" = glob1 => false
  glob1 = glob1 => true
  table:make = table:make => true
  O> table:put glob1 1 10
  glob1 = table:make => false
  table:make = glob1 => false
  O> set glob2 table:make
  glob1 = glob2 => false
  glob2 = glob1 => false
  O> table:put glob2 1 5
  glob1 = glob2 => false
  glob2 = glob1 => false
  O> table:put glob2 1 10
  glob1 = glob2 => true
  glob2 = glob1 => true
  O> crt 1
  O> table:put glob2 0 turtle 0
  glob1 = glob2 => false
  glob2 = glob1 => false
  O> table:put glob1 0 turtle 0
  glob1 = glob2 => true
  glob2 = glob1 => true
  O> ct
  glob1 = glob2 => true
  glob2 = glob1 => true
  O> table:put glob1 0 nobody
  glob1 = glob2 => true
  glob2 = glob1 => true
  O> crt 1
  glob1 = glob2 => true
  glob2 = glob1 => true
  O> table:put glob2 0 turtle 0
  glob1 = glob2 => false
  glob2 = glob1 => false


TablesOfTables
  extensions [ table ]
  globals [glob1]
  O> set glob1 table:from-list ( list (list 0 table:from-list [[1 2] [3 4]]) )
  (word glob1) => "{{table: [[0 {{table: [[1 2] [3 4]]}}]]}}"

TableCounts
  extensions [ table ]
  (word table:counts ["a" 0 "a" 4 [5] [5]]) => "{{table: [[\"a\" 2] [0 1] [4 1] [[5] 2]]}}"

TableValues
  extensions [ table ]
  globals [ t ]
  O> set t table:make
  table:values t => []
  O> table:put t 1 "a"
  table:values t => ["a"]
  O> table:put t 2 "b"
  table:values t => ["a" "b"]
  O> table:put t list 1 2 -1
  table:values t => ["a" "b" -1]
  O> table:put t "a" "testing values"
  table:values t => ["a" "b" -1 "testing values"]
  O> table:remove t 2
  table:values t => ["a" -1 "testing values"]
  O> table:put t -1 -1
  table:values t => ["a" -1 "testing values" -1]
  
TableGroupItems
  extensions [ table ]
  (word table:group-items range 10 [ n -> n mod 2 ]) => "{{table: [[0 [0 2 4 6 8]] [1 [1 3 5 7 9]]]}}"

TableGroupAgents
  extensions [ table ]
  globals [ t ]
  O> crt 3 [ set color red ]
  O> crt 4 [ set color green ]
  O> crt 5 [ set color blue ]
  O> set t table:group-agents turtles [ color ]
  count table:get t red => 3
  count table:get t green => 4
  count table:get t blue => 5

TableGetOrDefault
  extensions [ table ]
  table:get-or-default (table:from-list [[1 2]]) 1 3 => 2
  table:get-or-default (table:from-list [[1 2]]) 2 3 => 3